# 关于时间与知识积累的思考

## 前言

最近我喝了很多心灵鸡汤，结合自己对未来的一些思考，决定把我最近的想法写下来，写给未来的自己。

## 关于时间的思考

前些日子看了一篇关于时间的文章（很抱歉，我已经找不到这篇文章的地址了），它讲述了人对于时间长度的认知。我记得的大意为：大部分小孩子认为时间是很漫长的，而大人会觉得时间很短暂，总感觉一天很快就过去了。其中的缘由我是不太了解的，总之涉及到一些心理学方面的知识。但是我自己的感受是：

    时间过得很快，而我有很多梦想想去实现。在多年之后，我能否实现我现在的梦想？

## 对未来时间的感知

在前面提到的文章里，讲到了关于未来时间的感知。大概的意思是，绝大部分人对未来的时间是没有概念的，尤其是对长距离的未来更是如此。举个例子，你知道明天是多长时间吗？这个问题很好回答，那你知道之后十年是多长时间吗？相信没有多少人知道了，因为它离我们太遥远了，而我们的经验没有这种长时间概念的参考，所以十年就是一个数字了。

我个人觉得人感知时间是通过做过的事情来完成的。我今天做了很多有意义的事，今天的时间就很有意义、很充实；今天我在家玩了一天游戏，那么今天的时间就感觉很空虚。

对时间有准确的感知，在对未来作预测时就越有把握。而我想表达的观点就是，提高自己对时间的感知力，合理规划自己的未来，因为我想成为一个 **优秀** 的人。

## 搭建博客的意义

作为一个程序员，注定了要和各种各样不断更新的技术做朋友。在工作的两年时间里，我看到了很多非常牛逼的人。他们雄厚的技术积累和对于新技术的热情让我由衷地佩服，我也希望成为和他们一样的大牛。但是如何做到这一点我却还不知道。我也曾想过一个五年的计划，但是面对这五年我又感到十分迷茫，因为我不知道这五年要做什么，我又能有几个五年呢。

IT 领域的知识太多了，我只能选择其中的一些方面去学习。就在昨天，我还是很担心万一方向选择错了会怎样。但是今天，我决定抛开这种担心，因为我要成为 **优秀** 的人。

知识是需要积累的，而人的记忆力并没有那么好，所以我搭建了自己的博客，来记录我学习到的知识。

## 小结

为了让自己能够坚持学习下去，忍受住学习的孤独，我会坚持将博客维护好。博客不仅是知识的积累，也是让我的时间充实的方式。当我回忆自己的过去时，博客能够让我觉得我的坚持都是有意义的，我的时间是足够充实的。那时，我会觉得我是开心的，这就够了。



